bat
bitwarden-cli
blueutil
bpython
cargo-nextest
cloc
cmake
cmake-docs
composer
danvergara/tools/dblab
delve
docker-compose
epr
eza
fastfetch
fd
fnm
gh
git-crypt
git-delta
gnu-sed
gradle
homebank
hugo
jq
k9s
lazydocker
lazygit
litecli
maven
ncdu
neofetch
openjdk@17
openjdk@21
perl
pnpm
putty
qalculate-gtk
ripgrep
sevenzip
sherlock
speedtest-cli
stow
tldr
tmux
tree
uv
uvicorn
vim
virtualenv
wget
yarn
yazi
yt-dlp
zellij
